#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_vpc.vpc: Reading...
data.aws_iam_role.labrole: Reading...
data.aws_iam_role.labrole: Read complete after 1s [id=LabRole]
data.aws_vpc.vpc: Read complete after 1s [id=vpc-079792477e2f8277e]
data.aws_subnets.subnets: Reading...
aws_security_group.sg: Refreshing state... [id=sg-0f499e89ea38d590e]
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
data.aws_subnet.subnet["subnet-0a30970939f664e5f"]: Reading...
data.aws_subnet.subnet["subnet-0f649123fa019ba28"]: Reading...
data.aws_subnet.subnet["subnet-0a24bd7f26628f58a"]: Reading...
data.aws_subnet.subnet["subnet-0845fd9c70e5233b2"]: Reading...
data.aws_subnet.subnet["subnet-0a30d9bd46572e12b"]: Reading...
data.aws_subnet.subnet["subnet-046590e8dc96f93c6"]: Reading...
data.aws_subnet.subnet["subnet-0a24bd7f26628f58a"]: Read complete after 0s [id=subnet-0a24bd7f26628f58a]
data.aws_subnet.subnet["subnet-0f649123fa019ba28"]: Read complete after 0s [id=subnet-0f649123fa019ba28]
data.aws_subnet.subnet["subnet-0a30970939f664e5f"]: Read complete after 0s [id=subnet-0a30970939f664e5f]
data.aws_subnet.subnet["subnet-0845fd9c70e5233b2"]: Read complete after 0s [id=subnet-0845fd9c70e5233b2]
data.aws_subnet.subnet["subnet-0a30d9bd46572e12b"]: Read complete after 0s [id=subnet-0a30d9bd46572e12b]
data.aws_subnet.subnet["subnet-046590e8dc96f93c6"]: Read complete after 0s [id=subnet-046590e8dc96f93c6]
aws_eks_cluster.eks-cluster: Refreshing state... [id=MechTechApi]
aws_eks_node_group.node-group: Refreshing state... [id=MechTechApi:NG-MechTechApi]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_access_entry.access-entry will be created
  + resource "aws_eks_access_entry" "access-entry" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "MechTechApi"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "fiap",
          + "live",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam:::AWS_ACCOUNT_ID:role/voclabs"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.eks-policy will be created
  + resource "aws_eks_access_policy_association" "eks-policy" {
      + associated_at = (known after apply)
      + cluster_name  = "MechTechApi"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam:::AWS_ACCOUNT_ID:role/voclabs"

      + access_scope {
          + type = "cluster"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @ervinnotari, Action: `pull_request`*